Revit 2027 API
VoltageTypeSet.Erase Method
Removes a specified voltage type from the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	VoltageType item
)
Public Overridable Function Erase (
	item As VoltageType
) As Integer
public:
virtual int Erase(
	VoltageType^ item
)
abstract Erase :
        item : VoltageType -> int
override Erase :
        item : VoltageType -> int
Parameters
item VoltageType
The voltage type to be erased.
Return Value
Int32
The number of voltage types that were erased from the set.
See Also
Reference
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace